## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 18 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                      |
|----------|------------------------------------------------|
| update   | `aws_lambda_function.audit_logs`               |
|          | `aws_lambda_function.audit_logs_archiver`      |
|          | `aws_lambda_function.form_archiver`            |
|          | `aws_lambda_function.nagware`                  |
|          | `aws_lambda_function.reliability`              |
|          | `aws_lambda_function.reliability_dlq_consumer` |
|          | `aws_lambda_function.response_archiver`        |
|          | `aws_lambda_function.submission`               |
|          | `aws_lambda_function.vault_integrity`          |
|          | `aws_s3_object.audit_logs_archiver_code`       |
|          | `aws_s3_object.audit_logs_code`                |
|          | `aws_s3_object.form_archiver_code`             |
|          | `aws_s3_object.nagware_code`                   |
|          | `aws_s3_object.reliability_code`               |
|          | `aws_s3_object.reliability_dlq_consumer_code`  |
|          | `aws_s3_object.response_archiver_code`         |
|          | `aws_s3_object.submission_code`                |
|          | `aws_s3_object.vault_integrity_code`           |
| recreate | `aws_signer_signing_job.vault_integrity[0]`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "Audit_Logs"
      ~ last_modified                  = "2024-03-15T13:46:13.000+0000" -> (known after apply)
      ~ s3_object_version              = "AUJ430SITKAR0SC.DpjsXdw0iP5ntwXp" -> (known after apply)
      ~ source_code_hash               = "8XJrXQPGK78QNXqkYizyGlH5uM+xYA/x57QzSc/sbKw=" -> "dBqUqcnuGrNGYgLZqTXoDQ8jVfedBlbom4xMc1Dpt7Q="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs_archiver will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs_archiver" {
        id                             = "Audit_Logs_Archiver"
      ~ last_modified                  = "2024-02-20T17:14:02.647+0000" -> (known after apply)
      ~ s3_object_version              = "bMDQzYU6tawp4CUVqctMsk9nqAIirObZ" -> (known after apply)
      ~ source_code_hash               = "j21QkAUTlKxkmkad5xW89Zgl6fwIQ54MWvLhLAnhwdI=" -> "HzbLRL7rblvrnaEC8enHyX/4J06Rsen3mNS+LKInnd8="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "Archive_Form_Templates"
      ~ last_modified                  = "2024-04-09T19:02:51.000+0000" -> (known after apply)
      ~ s3_object_version              = "abRfM2DX7WwemV.SuTE_2Mc9eU0DrDkp" -> (known after apply)
      ~ source_code_hash               = "tZom8NvYkLTCiFBHAx0p97qloJ1ZcMMumoKxxhc4SWc=" -> "DaAhONmQ/N8JTD/ObmLlmvtNU9SQT79AvDPcb3Ifjyw="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ last_modified                  = "2024-04-09T19:02:46.000+0000" -> (known after apply)
      ~ s3_object_version              = "KyCYYJA9Gs44WT7Ups8oU49qpGhxfW.k" -> (known after apply)
      ~ source_code_hash               = "ewsERJHdgUqXPuAunXW9Djvue3VCJbRmdbJySbEUXMY=" -> "U7FFfRT0YObno/YdDp6F9tZ4J3iZPPTIvn8i1OF5I98="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2024-04-22T14:01:41.000+0000" -> (known after apply)
      ~ s3_object_version              = "kTorjeerPtRM4w1pwNIig3.4D4YxE3JD" -> (known after apply)
      ~ source_code_hash               = "gyCSkTbBtROZbqEOQMsEWTd3X+JXF91xF4ufJrDBrys=" -> "bErEkKsPDYll8LZsAHL8UsDC5Jp0XayQ+rXub4TX3p4="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer will be updated in-place
  ~ resource "aws_lambda_function" "reliability_dlq_consumer" {
        id                             = "Reliability_DLQ_Consumer"
      ~ last_modified                  = "2024-02-08T18:31:43.556+0000" -> (known after apply)
      ~ s3_object_version              = "BvpQY3NZQMaRMOsGpoZWavOy3AZupOJY" -> (known after apply)
      ~ source_code_hash               = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> "pGElz0Wdh2w/AlSUjfarRKXpLUFZYRKABhjPAwbIR4U="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver will be updated in-place
  ~ resource "aws_lambda_function" "response_archiver" {
        id                             = "Response_Archiver"
      ~ last_modified                  = "2024-02-08T18:31:43.601+0000" -> (known after apply)
      ~ s3_object_version              = "Hooe7gUS8n2KyXfCqL6CuX9xUeCBapo6" -> (known after apply)
      ~ source_code_hash               = "iCOPYEkuyPrXdcFRLr6qL6swUo/kXiUZTdHb0tWWuOE=" -> "nRLYuXaBfXIvzhVua1gw5UDNLPGYTTDQ1SUqucZPYeo="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2024-03-15T13:46:14.000+0000" -> (known after apply)
      ~ s3_object_version              = "MnDwZ.Kvqsf5nNQdD39DAXo1ypnCEJhj" -> (known after apply)
      ~ source_code_hash               = "DJVk2STondW1jm6Vj61kIHKK8sQw/oCC/75SlBdG3b8=" -> "oKYXSO87SspG9QPkbLUEId70t3cAUsVktWMDFB0lELY="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2024-04-22T14:01:40.000+0000" -> (known after apply)
      ~ s3_bucket                      = "forms-staging-lambda-code" -> (known after apply)
      ~ s3_key                         = "signed/29941171-a3bb-4511-be92-2c7d9ddd8912" -> (known after apply)
      ~ source_code_hash               = "PD5RmSEVjAYMZc1lvfSSn6O3RadR+J09hCPKVbQS/+g=" -> "nNYOFy8Vam4JSlyQVd95+qsIzp3X4tylNE3pCsjPSwg="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.audit_logs_archiver_code will be updated in-place
  ~ resource "aws_s3_object" "audit_logs_archiver_code" {
        id                     = "audit_logs_archiver_code"
      ~ source_hash            = "j21QkAUTlKxkmkad5xW89Zgl6fwIQ54MWvLhLAnhwdI=" -> "HzbLRL7rblvrnaEC8enHyX/4J06Rsen3mNS+LKInnd8="
        tags                   = {}
      ~ version_id             = "bMDQzYU6tawp4CUVqctMsk9nqAIirObZ" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.audit_logs_code will be updated in-place
  ~ resource "aws_s3_object" "audit_logs_code" {
        id                     = "audit_logs_code"
      ~ source_hash            = "8XJrXQPGK78QNXqkYizyGlH5uM+xYA/x57QzSc/sbKw=" -> "dBqUqcnuGrNGYgLZqTXoDQ8jVfedBlbom4xMc1Dpt7Q="
        tags                   = {}
      ~ version_id             = "AUJ430SITKAR0SC.DpjsXdw0iP5ntwXp" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.form_archiver_code will be updated in-place
  ~ resource "aws_s3_object" "form_archiver_code" {
        id                     = "form_archiver_code"
      ~ source_hash            = "tZom8NvYkLTCiFBHAx0p97qloJ1ZcMMumoKxxhc4SWc=" -> "DaAhONmQ/N8JTD/ObmLlmvtNU9SQT79AvDPcb3Ifjyw="
        tags                   = {}
      ~ version_id             = "abRfM2DX7WwemV.SuTE_2Mc9eU0DrDkp" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.nagware_code will be updated in-place
  ~ resource "aws_s3_object" "nagware_code" {
        id                     = "nagware_code"
      ~ source_hash            = "ewsERJHdgUqXPuAunXW9Djvue3VCJbRmdbJySbEUXMY=" -> "U7FFfRT0YObno/YdDp6F9tZ4J3iZPPTIvn8i1OF5I98="
        tags                   = {}
      ~ version_id             = "KyCYYJA9Gs44WT7Ups8oU49qpGhxfW.k" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.reliability_code will be updated in-place
  ~ resource "aws_s3_object" "reliability_code" {
        id                     = "reliability_code"
      ~ source_hash            = "gyCSkTbBtROZbqEOQMsEWTd3X+JXF91xF4ufJrDBrys=" -> "bErEkKsPDYll8LZsAHL8UsDC5Jp0XayQ+rXub4TX3p4="
        tags                   = {}
      ~ version_id             = "kTorjeerPtRM4w1pwNIig3.4D4YxE3JD" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.reliability_dlq_consumer_code will be updated in-place
  ~ resource "aws_s3_object" "reliability_dlq_consumer_code" {
        id                     = "reliability_dlq_consumer_code"
      ~ source_hash            = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> "pGElz0Wdh2w/AlSUjfarRKXpLUFZYRKABhjPAwbIR4U="
        tags                   = {}
      ~ version_id             = "BvpQY3NZQMaRMOsGpoZWavOy3AZupOJY" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.response_archiver_code will be updated in-place
  ~ resource "aws_s3_object" "response_archiver_code" {
        id                     = "response_archiver_code"
      ~ source_hash            = "iCOPYEkuyPrXdcFRLr6qL6swUo/kXiUZTdHb0tWWuOE=" -> "nRLYuXaBfXIvzhVua1gw5UDNLPGYTTDQ1SUqucZPYeo="
        tags                   = {}
      ~ version_id             = "Hooe7gUS8n2KyXfCqL6CuX9xUeCBapo6" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.submission_code will be updated in-place
  ~ resource "aws_s3_object" "submission_code" {
        id                     = "submission_code"
      ~ source_hash            = "DJVk2STondW1jm6Vj61kIHKK8sQw/oCC/75SlBdG3b8=" -> "oKYXSO87SspG9QPkbLUEId70t3cAUsVktWMDFB0lELY="
        tags                   = {}
      ~ version_id             = "MnDwZ.Kvqsf5nNQdD39DAXo1ypnCEJhj" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.vault_integrity_code will be updated in-place
  ~ resource "aws_s3_object" "vault_integrity_code" {
        id                     = "vault_integrity_code"
      ~ source_hash            = "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws=" -> "nNYOFy8Vam4JSlyQVd95+qsIzp3X4tylNE3pCsjPSwg="
        tags                   = {}
      ~ version_id             = "T8_Y3lOs.tGjMhrm1ldzVlrAUqMcFexl" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_signer_signing_job.vault_integrity[0] must be replaced
-/+ resource "aws_signer_signing_job" "vault_integrity" {
      ~ completed_at               = "2024-01-11T18:12:31Z" -> (known after apply)
      ~ created_at                 = "2024-01-11T18:12:29Z" -> (known after apply)
      ~ id                         = "29941171-a3bb-4511-be92-2c7d9ddd8912" -> (known after apply)
      ~ job_id                     = "29941171-a3bb-4511-be92-2c7d9ddd8912" -> (known after apply)
      ~ job_invoker                = "687401027353" -> (known after apply)
      ~ job_owner                  = "687401027353" -> (known after apply)
      ~ platform_display_name      = "AWS Lambda" -> (known after apply)
      ~ platform_id                = "AWSLambda-SHA384-ECDSA" -> (known after apply)
      ~ profile_version            = "3cak3nO7rT" -> (known after apply)
      ~ requested_by               = "arn:aws:iam::687401027353:user/GitHub_Terraform" -> (known after apply)
      ~ revocation_record          = [] -> (known after apply)
      ~ signature_expires_at       = "2035-04-11T18:12:31Z" -> (known after apply)
      ~ signed_object              = [
          - {
              - s3 = [
                  - {
                      - bucket = "forms-staging-lambda-code"
                      - key    = "signed/29941171-a3bb-4511-be92-2c7d9ddd8912"
                    },
                ]
            },
        ] -> (known after apply)
      ~ status                     = "Succeeded" -> (known after apply)
      ~ status_reason              = "Signing Succeeded" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ source {
          ~ s3 {
              ~ version = "T8_Y3lOs.tGjMhrm1ldzVlrAUqMcFexl" # forces replacement -> (known after apply) # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 18 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN -...
```

</details>
